yuplus/nxp-mcx-series/MCXA366/drivers/fsl_lpi2c_edma.c
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpi2c_edma_c_ref_3$
     */
    if((0U != (LPI2C_MasterGetEnabledInterrupts(base) & (uint32_t)kLPI2C_MasterTxReadyFlag)) && (0U != (status & (uint32_t)kLPI2C_MasterTxReadyFlag)))
    {
        if(handle->remainingCommand > 0U)
        {
            uint32_t i;
            uint32_t maxTxFifo = (handle->base->PARAM & LPI2C_PARAM_MTXFIFO_MASK) >> LPI2C_PARAM_MTXFIFO_SHIFT;
            uint32_t txCount = maxTxFifo - ((base->MFSR & LPI2C_MFSR_TXCOUNT_MASK) >> LPI2C_MFSR_TXCOUNT_SHIFT);
            for(i = 0; i < MIN(txCount, handle->remainingCommand); i++)
            {
                base->MTDR = handle->commandBuffer[handle->commandIndex + i];
            }
            handle->remainingCommand -= i;
            handle->commandIndex += i;
        }
        if(handle->remainingCommand == 0U)
        {
            LPI2C_MasterDisableInterrupts(handle->base, (uint32_t)kLPI2C_MasterTxReadyFlag);
        }
    }
    else
    {
        /* Terminate DMA transfers. */
        EDMA_AbortTransfer(handle->rx);
        if (FSL_FEATURE_LPI2C_HAS_SEPARATE_DMA_RX_TX_REQn(base) != 0)
        {
            EDMA_AbortTransfer(handle->tx);
        }

        /* Done with this transaction. */
        handle->isBusy = false;

        /* Disable LPI2C interrupts. */
        LPI2C_MasterDisableInterrupts(base, (uint32_t)kLPI2C_MasterIrqFlags);

        /* Check error status */
        if (0U != (status & (uint32_t)kLPI2C_MasterPinLowTimeoutFlag))
        {
            result = kStatus_LPI2C_PinLowTimeout;
        }
        else if (0U != (status & (uint32_t)kLPI2C_MasterArbitrationLostFlag))
        {
            result = kStatus_LPI2C_ArbitrationLost;
        }
        else if (0U != (status & (uint32_t)kLPI2C_MasterNackDetectFlag))
        {
            result = kStatus_LPI2C_Nak;
        }
        /*
         * $Branch Coverage Justification$
         * Check of last possible flag - shouldn't be false
         */
        else if (0U != (status & (uint32_t)kLPI2C_MasterFifoErrFlag)) /* GCOVR_EXCL_BR_START */
        {
            result = kStatus_LPI2C_FifoError;
        }
        else /* GCOVR_EXCL_BR_STOP */
        {
            ; /* Intentional empty */
        }

        /* Clear error status. */
        (void)LPI2C_MasterCheckAndClearError(base, status);

        /* Send stop flag if needed */
        if (0U == (handle->transfer.flags & (uint32_t)kLPI2C_TransferNoStopFlag))
        {
            status = LPI2C_MasterGetStatusFlags(base);
            /* If bus is still busy and the master has not generate stop flag */
            if ((status & ((uint32_t)kLPI2C_MasterBusBusyFlag | (uint32_t)kLPI2C_MasterStopDetectFlag)) ==
                (uint32_t)kLPI2C_MasterBusBusyFlag)
            {
                /* Send a stop command to finalize the transfer. */
                handle->base->MTDR = (uint32_t)kStopCmd;
            }
        }

        /* Invoke callback. */
        if (handle->completionCallback != NULL)
        {
            handle->completionCallback(base, handle, result, handle->userData);
        }
    }
}
